{
    "navbar__home": "Accueil",
    "navbar__projects": "Projets",
    "navbar__career": "Parcours",
    "navbar__skills": "Compétences",
    "navbar__contact": "Contact",
    "navbar__darkmode": "Mode sombre",
    "navbar__language": "Language",
    "home__title": "Bienvenue sur mon portfolio en ligne !",
    "home__intro__pt1": "Je m'appelle Charly FLU, je suis développeur.",
    "home__intro__pt2": "Je suis actuellement étudiant à l'",
    "home__intro__pt3": "Université Robert Schuman",
    "home__intro__pt4": "en France.",
    "home__intro__pt5": "J'ai fait ce site pour vous montrer mes compétences et mes projets, et surtout, parce que j'ai toujours voulu avoir mon propre site web pour expérimenter.",
    "home__intro__pt6": "Et je travaille avec l'entreprise ",
    "home__intro__pt7": "ABAS France ",
    "home__intro__pt8": "dans le cadre de mon alternance en tant qu'analyste programmeur.",
    "home__intro__pt9": "Ce site est toujours en développement ! (je dois ajouter des projets et des compétences).",
    "home__projects__title": "Mes projets favoris",
    "home__skills__title": "Mes compétences",
    "projects__title": "Projets",
    "project__chess__title": "Jeu d'échecs",
    "project__chess__desc": "Un jeu d'échecs entièrement fonctionnel fait en Java Swing. Détecte les échecs, les échecs et mat, les pat, les prises en passant, et le roque. Détecte également si un mouvement est illégal et ne le permet pas.",
    "project__chess__img__alt": "Capture d'écran du jeu d'échecs",
    "project__espagnol__title": "Espagnol Super Facil",
    "project__espagnol__desc": "Espagnol Super Facil est une application de bureau pour apprendre l'espagnol faite en WinForm. C'est un projet de groupe que j'ai fait pour mes études. J'étais en charge de la structure de l'application, de la partie admin et de la connexion entre la base de données et l'application.",
    "project__espagnol__img__alt": "Capture d'écran d'Espagnol Super Facil",
    "project__mars__title": "MarsGriculteur",
    "project__mars__desc": "MarsGriculteur est un jeu type tycoon fait en Unity. C'est un projet de groupe que j'ai fait pour mes études. J'étais en charge du système de marché et des événements, j'ai également conçu la carte et les objets.",
    "project__mars__img__alt": "Capture d'écran de MarsGriculteur",
    "project__spotidata__title": "Spotidata",
    "project__spotidata__desc": "Spotidata est une application web faite avec le framework Express, utilisant React pour le front-end, et Node.js pour le back-end. Elle permet d'obtenir beaucoup de statistiques sur votre compte Spotify. Cela a été fait pour l'école en groupe de 3 personnes.",
    "project__spotidata__img__alt": "Capture d'écran du site web de Spotidata",
    "project__asteroids__title": "Asteroides récursifs",
    "project__asteroids__desc": "Asteroides récursifs est un algorithme en C qui contrôle un vaisseau spatial qui évite des astéroides. Il calcule récursivement chaque chemin possible, ou s'arrête quand il trouve un chemin qui peut aller jusqu'à la fin de l'écran. Il se répète à chaque itération.",
    "project__asteroids__img__alt": "Capture d'écran de la console Asteroides récursifs",
    "career__title": "Parcours",
    "career__schwilgue": "J'ai obtenu mon baccalauréat avec mention très bien, spécialité informatique et mathématiques, avec l'option math expert et math en anglais. Je l'ai obtenu au Lycée Jean Baptiste Schwilgue à Sélestat.",
    "career__schwilgue__alt":"Lycée Jean Baptiste Schwilgue à Sélestat",
    "career__tabacco": "J'ai été cueilleur de tabac pendant un mois entier dans le cadre d'un job d'été. J'ai découvert la dureté du travail dans les champs et l'importance du travail d'équipe.",
    "career__tabacco__alt": "Champs de tabac",
    "career__pizza": "J'ai travaillé comme pizzaïolo pendant 1 mois à Pizza Stella à Krafft en tant que job d'été. J'ai appris à travailler en équipe, à ne pas gêner mes collègues et à me comporter avec les clients.",
    "career__pizza__alt": "Pizza Stella à Krafft",
    "career__iut__2021": "Un an et demi de mon BUT en informatique a été passé à l'IUT Robert Schuman à Illkirch-Graffenstaden. J'y ai appris les bases avancées de la programmation et des mathématiques.",
    "career__iut__2021__alt": "IUT Robert Schuman à Illkirch-Graffenstaden",
    "career__mtu": "J'ai passé un semestre en Erasmus au MTU à Cork, en Irlande, où j'ai perfectionné mon anglais, et continué mon BUT en informatique.",
    "career__mtu__alt": "MTU à Cork, Irlande",
    "career__hindserhof": "J'ai travaillé comme cuisinier pendant plus de deux mois au restaurant Hindserhof à Hindisheim dans le cadre d'un job d'été. J'ai appris à gérer une équipe, à travailler sous pression et à improviser avec les moyens du bord.",
    "career__hindserhof__alt": "Restaurant Hindserhof à Hindisheim",
    "career__iut__2023": "Je vais finir mon BUT en informatique à l'IUT Robert Schuman à Illkirch-Graffenstaden. La dernière année est en alternance, et je la fais dans une entreprise près de Strasbourg.",
    "career__iut__2023__alt": "Fête de l'IUT 2022 Robert Schuman à Illkirch-Graffenstaden",
    "career__abas": "Je travaille actuellement en alternance chez ABAS France en tant qu'analyste programmeur spécialisé en Java. J'y apprends à travailler en équipe, à gérer mon temps et à comprendre les besoins des clients.",
    "career__abas__alt": "Logo d'ABAS-Forterro et preview de l'ERP ABAS",
    "career__today":"aujourd'hui",
    "skills__title": "Compétences",
    "skill__level__beginner": "Débutant",
    "skill__level__intermediate": "Intermédiaire",
    "skill__level__advanced": "Avancé",
    "skill__level__expert": "Expert",
    "skill__tab__core__lang": "Langages de programmation de base",
    "skill__tab__webdev": "Développement Web",
    "skill__tab__backend": "Développement Back-end",
    "skill__tab__tools__practices": "Outils et pratiques",
    "skill__tab__other": "Autres",
    "contact__title": "Contact",
    "footer__license__pt1": "© 2023 - Charly FLU",
    "footer__license__pt2": "Licence MIT",
    "footer__github": "Voir le projet sur GitHub",
    "footer__built": "Construit par Charly FLU en utilisant uniquement React.js, HTML et CSS.",
    "footer__thanks": "Merci d'avoir lu jusqu'au bout, j'espère que vous avez apprécié ce site web."
}