{
    "navbar__home": "Home",
    "navbar__projects": "Projects",
    "navbar__career": "Career",
    "navbar__skills": "Skills",
    "navbar__contact": "Contact",
    "navbar__darkmode": "Dark mode",
    "navbar__language": "Language",
    "home__title": "Hi, welcome on my online portfolio !",
    "home__intro__pt1": "My name is Charly FLU, I'm a developer.",
    "home__intro__pt2": "I'm currently studying at the",
    "home__intro__pt3": "University of Robert Schuman",
    "home__intro__pt4": "in France.",
    "home__intro__pt5": "I built this website to show you my skills and my projects, and most of all, because I always wanted to have my own website to experiment things.",
    "home__intro__pt6": "I'm currently working with the company ",
    "home__intro__pt7": "ABAS France",
    "home__intro__pt8": "as part of my work-study program as a analyst developer.",
    "home__intro__pt9": "This website still under development ! (I have to update the projects and the skills)",
    "home__projects__title": "My favourite projects",
    "home__skills__title": "My skills",
    "projects__title": "Projects",
    "project__chess__title": "Chess game",
    "project__chess__desc": "A completly working chess game made in Java Swing. It detects checks, checkmates, stalemates, en passant captures, and castling. Also detects if a move is illegal and don't allow it. And more...",
    "project__chess__img__alt": "Chess game screenshot",
    "project__espagnol__title": "Espagnol Super Facil",
    "project__espagnol__desc": "Espagnol Super Facil is a desktop application to learn Spanish, made using WinForm. It's a group project I made for my studies. I was in charge of the structure of the application and the connection between the database and the application.",
    "project__espagnol__img__alt": "Espagnol Super Facil screenshot",
    "project__mars__title": "MarsGriculteur",
    "project__mars__desc": "MarsGriculteur is a tycoon game made in Unity. It's a group project made for my studies. I was in charge of the market system and the events, I also designed the map and the items.",
    "project__mars__img__alt": "MarsGriculteur screenshot",
    "project__spotidata__title": "Spotidata",
    "project__spotidata__desc": "Spotidata is a web application made with the framework Express, using in React for the front end, and Node.js for the back-end. It allows you to get lots of statistics about your Spotify account. This was made for school in a group of 3 people.",
    "project__spotidata__img__alt": "Spotidata's website screenshot",
    "project__asteroids__title": "Recursive asteroids",
    "project__asteroids__desc": "Recursive asteroids is C aglorithm that control a spaceship to avoid asteriods. It calculates recursively each possible path, or stop when it find a path that can go to the end of the screen. Repeat itself with each iteration",
    "project__asteroids__img__alt": "Recursive asteroids console screenshot",
    "career__title": "Career",
    "career__schwilgue": "I obtained my baccalauréat with first class honors, specializing in computer science and mathematics, with the option of expert math and math in English. I obtained it at the Lycée Jean Baptiste Schwilgue in Sélestat.",
    "career__schilgue__alt": "College Jean Baptiste Schwilgue at Selestat",
    "career__tabacco": "I was a tobacco picker for a whole month as part of a summer job. I discovered the hardness of working in the field and the importance of teamwork.",
    "career__tabacco__alt":"Tobacco field",
    "career__pizza": "I worked as a pizza maker for 1 month at Pizza Stella in Krafft as a summer job. I learned how to work as part of a team, how not to get in the way of my colleagues and how to behave with customers.",
    "career__pizza__alt": "Pizza Stella in Krafft",
    "career__iut__2021": "A year and a half of my BUT in computer science was spent at the IUT Robert Schuman in Illkirch-Graffenstaden. There I learned advanced programming basics and advanced mathematics.",
    "career__iut__2021__alt": "IUT Robert Schuman in Illkirch-Graffenstaden",
    "career__mtu": "I spent half a year on Erasmus at MTU in Cork, Ireland, where I improved my English, and continued my BUT in computer science.",
    "career__mtu__alt": "MTU in Cork, Ireland",
    "career__hindserhof": "I worked as a cook for over two months at the Hindserhof restaurant in Hindisheim as part of a summer job. I learned how to manage a team, work under pressure and improvise with the means at hand.",
    "career__hindserhof__alt": "Hindserhof restaurant in Hindisheim",
    "career__iut__2023": "I will finish my BUT in computer science at the IUT Robert Schuman in Illkirch-Graffenstaden. The last year is a work-study program, and Im doing it at a company near Strasbourg",
    "career__iut__2023__alt": "Back-to-school party in 2022 in the IUT Robert Schuman",
    "career__today": "now",
    "skills__title": "Skills",
    "skill__level__beginner": "Beginner",
    "skill__level__intermediate": "Intermediate",
    "skill__level__advanced": "Advanced",
    "skill__level__expert": "Expert",
    "contact__title": "Contact",
    "footer__license__pt1": "© 2023 - Charly FLU",
    "footer__license__pt2": "MIT License",
    "footer__github": "See the repository on GitHub",
    "footer__built": "Built by Charly FLU using only React.js, HTML and CSS.",
    "footer__thanks": "Thank you for reading to the end, I hope you enjoyed this website."
}