{
    "navbar__home": "Home",
    "navbar__projects": "Projects",
    "navbar__career": "Career",
    "navbar__skills": "Skills",
    "navbar__contact": "Contact",
    "navbar__darkmode": "Dark Mode",
    "navbar__language": "Language",
    "home__title": "Hi, welcome to my online portfolio!",
    "home__intro__pt1": "My name is Charly FLU, I'm a developer.",
    "home__intro__pt2": "I'm currently studying at",
    "home__intro__pt3": "the University of Robert Schuman",
    "home__intro__pt4": "in France.",
    "home__intro__pt5": "I built this website to showcase my skills and projects, and most importantly, because I've always wanted to have my own website to experiment with.",
    "home__intro__pt6": "And I'm working with the company",
    "home__intro__pt7": "ABAS France",
    "home__intro__pt8": "as part of my work-study program as an analyst developer.",
    "home__intro__pt9": "This website is still under development !",
    "home__projects__title": "My Projects",
    "home__skills__title": "My Skills",
    "projects__title": "Projects",
    "project__chess__title": "Chess Game",
    "project__chess__desc": "A fully functional chess game made in Java Swing. It detects checks, checkmates, stalemates, en passant captures, and castling. It also detects if a move is illegal and prevents it.",
    "project__chess__img__alt": "Screenshot of Chess Game",
    "project__espagnol__title": "Espagnol Super Facil",
    "project__espagnol__desc": "Espagnol Super Facil is a desktop application for learning Spanish, made using WinForm. It's a group project I completed for my studies. I was responsible for the application structure and the connection between the database and the application.",
    "project__espagnol__img__alt": "Screenshot of Espagnol Super Facil",
    "project__mars__title": "MarsGriculteur",
    "project__mars__desc": "MarsGriculteur is a tycoon game made in Unity. It's a group project completed for my studies. I was responsible for the market system and events. I also designed the map and items.",
    "project__mars__img__alt": "Screenshot of MarsGriculteur",
    "project__spotidata__title": "Spotidata",
    "project__spotidata__desc": "Spotidata is a web application made with the Express framework, using React for the frontend, and Node.js for the backend. It allows you to obtain numerous statistics about your Spotify account. This was a group project for school with 3 people.",
    "project__spotidata__img__alt": "Screenshot of Spotidata Website",
    "project__asteroids__title": "Recursive Asteroids",
    "project__asteroids__desc": "Recursive Asteroids is a C algorithm that controls a spaceship to avoid asteroids. It calculates recursively each possible path or stops when it finds a path that reaches the end of the screen. It repeats this process with each iteration.",
    "project__asteroids__img__alt": "Screenshot of Recursive Asteroids Console",
    "project__iastucieux__title": "IAstucieux",
    "project__iastucieux__desc": "IAstucieux is a python library that allows to very easily download install and use llama2 and automatic 1111 (stable diffusion), to use them in a python environment. It's a group project for school with 9 people, and I was in the lead of the project.",
    "project__iastucieux__img__alt": "Screenshot of IAstucieux GitHub Repository and example of use",
    "project__portfolio__title": "This Portfolio",
    "project__portfolio__desc": "This portfolio is a website made with React.js, HTML, and CSS. It's a personal project that I made to showcase my skills and projects. I also wanted to have my own website to experiment with.",
    "project__portfolio__img__alt": "Screenshot of This Portfolio Website",
    "projects__all": "All Projects", 
    "projects__best": "Best Projects",
    "projects__recent": "Recent Projects",
    "career__title": "Career",
    "career__schwilgue": "I obtained my baccalauréat with first-class honors, specializing in computer science and mathematics, with the option of expert math and math in English. I obtained it at the Lycée Jean Baptiste Schwilgue in Sélestat.",
    "career__schilgue__alt": "Lycée Jean Baptiste Schwilgue in Sélestat",
    "career__tabacco": "I worked as a tobacco picker for a whole month as part of a summer job. I discovered the challenges of working in the fields and the importance of teamwork.",
    "career__tabacco__alt": "Tobacco Field",
    "career__pizza": "I worked as a pizza maker for 1 month at Pizza Stella in Krafft as a summer job. I learned how to work as part of a team, not to disrupt my colleagues, and how to interact with customers.",
    "career__pizza__alt": "Pizza Stella in Krafft",
    "career__iut__2021": "A year and a half of my BUT in computer science was spent at the IUT Robert Schuman in Illkirch-Graffenstaden. There, I learned advanced programming basics and advanced mathematics.",
    "career__iut__2021__alt": "IUT Robert Schuman in Illkirch-Graffenstaden",
    "career__mtu": "I spent half a year on Erasmus at MTU in Cork, Ireland, where I improved my English and continued my BUT in computer science.",
    "career__mtu__alt": "MTU in Cork, Ireland",
    "career__hindserhof": "I worked as a cook for over two months at the Hindserhof restaurant in Hindisheim as part of a summer job. I learned how to manage a team, work under pressure, and improvise with the resources available.",
    "career__hindserhof__alt": "Hindserhof Restaurant in Hindisheim",
    "career__iut__2023": "I will finish my BUT in computer science at the IUT Robert Schuman in Illkirch-Graffenstaden. The last year is part of a work-study program, and I'm doing it at a company near Strasbourg.",
    "career__iut__2023__alt": "Back-to-school party in 2022 at the IUT Robert Schuman",
    "career__abas": "I'm currently participating in a work-study program at ABAS France as a programmer analyst specializing in Java. I'm learning to work in a team, manage my time, and understand customer needs.",
    "career__abas__alt": "ABAS-Forterro logo and ABAS ERP preview",
    "career__today": "now",
    "skills__title": "Skills",
    "skill__level__beginner": "Beginner",
    "skill__level__intermediate": "Intermediate",
    "skill__level__advanced": "Advanced",
    "skill__level__expert": "Expert",
    "skill__tab__core__lang": "Core Programming Languages",
    "skill__tab__webdev": "Web Development & Frontend",
    "skill__tab__backend": "Backend & Server-side Development",
    "skill__tab__tools__practices": "Development Tools & Practices",
    "skill__tab__other": "Other",
    "contact__title": "Contact",
    "footer__license__pt1": "© 2023 - Charly FLU",
    "footer__license__pt2": "MIT License",
    "footer__github": "See the project on GitHub",
    "footer__built": "Built by Charly FLU using only React.js, HTML, and CSS.",
    "footer__thanks": "Thank you for reading until the end, I hope you enjoyed this website."
}
